0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.96;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "walls"
    {
        //type            freestream;
        //freestreamValue uniform 1.5;   // Your incoming wind
        type            symmetry;
		//type            kLowReWallFunction;
        //value           uniform 0;
    }
    "(IEA-15-240-RWT-tower-rotated|floor)"
    {
		type            kLowReWallFunction;
        value           $internalField;
    }
    "IEA-15-240-RWT-rotor-rotated"
    {
		type            kLowReWallFunction;
        value           $internalField;
    }
    //farfield
    //{
    //    type            symmetry;	
    //}
    // farfield_baixo
    // {
	// 	type            kLowReWallFunction;
    //     value           $internalField;
    // }	
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

}


// ************************************************************************* //
