0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "walls"
    {
        // type            fixedFluxPressure;
		// value			uniform 0;
        //type            freestreamPressure;
        //freestreamValue uniform 0;  // relative pressure
        type            symmetry;

    }
    "(IEA-15-240-RWT-tower-rotated|floor)"
    {
		type            zeroGradient;
    }
    "IEA-15-240-RWT-rotor-rotated"
    {
		type            zeroGradient;
    }
    //farfield
    //{
    //    type            symmetry;
    //}
    // farfield_baixo
    // {
    //     type            fixedFluxPressure;
	// 	value			uniform 0;
    // }
    inlet
    {
        type            zeroGradient;
    }	
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
}

// ************************************************************************* //
