system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    ( -1920 -30 -480)
    (  480 -30 -480)
    (  480  630 -480)
    ( -1920  630 -480)
    ( -1920 -30 480)
    (  480 -30 480)
    (  480  630 480)
    ( -1920  630 480)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (120 33 48) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type symmetry;
        faces
        (
            (3 7 6 2)
            (0 3 2 1)
            (4 5 6 7)
        );
    }

    floor
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
);


// ************************************************************************* //
