system/vorticity1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          | 
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         | 
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    writeCellVolumes1;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


vorticity1
	{
    // Mandatory entries (unmodifiable)
    type        vorticity;
    libs        (fieldFunctionObjects);
	writeControl    timeStep;
    writeInterval   1;
	}